// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СгенерироватьТестовыеДанные(Команда)
	
	ОчиститьСообщения();
	
	Количество = Ждать ВвестиЧислоАсинх(10, НСтр("ru = 'Сколько?'"), 32, 0);
	Если Количество = Неопределено Или Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Заполнение текстового справочника'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СгенерироватьДанныеВФоне(Количество),
		Новый ОписаниеОповещения("ЗавершитьЗаполнение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыгрузки(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check undefined-variable
	//@skip-check dynamic-access-method-not-found
	кфкИнтеграцияКлиент.ИсторияВыгрузкиОбъекта(ТекущиеДанные.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершить заполнение.
// 
// Параметры:
//  Результат - Структура - Результат:
//   * Статус - Строка - Статус
//   * ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьЗаполнение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция СгенерироватьДанныеВФоне(Количество)
	
	Если Количество <= (РазмерПакета() * 1.5) Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
			"Справочники.кфк_т_ТестовыйСправочник.СгенерироватьТестовыеДанные", Количество);
		
	Иначе

		Возврат ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
			"Справочники.кфк_т_ТестовыйСправочник.СгенерироватьТестовыеДанные",
			ДлительныеОперации.ПараметрыВыполненияПроцедуры(),
			СформироватьНаборПараметров(Количество));
			
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьНаборПараметров(Количество)
	
	Результат = Новый Соответствие;
	
	РазмерПакета = РазмерПакета();
	Остаток = Количество;
	Для Номер = 1 По Цел(Количество / РазмерПакета) + 1 Цикл
		
		Результат.Вставить(СтрШаблон("ГенерацияТестовогоСправочника_%1", XMLСтрока(Номер)),
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Мин(Остаток, РазмерПакета)));
		
		Остаток = Остаток - РазмерПакета;
		Если Остаток <= 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазмерПакета()
	Возврат 5000;
КонецФункции

#КонецОбласти
