// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ГСЧ; // ГенераторСлучайныхЧисел 

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает случайное булево значение (Истина или Ложь).
//
// Возвращаемое значение:
//	Булево - Случайное булево значение (Истина или Ложь).
Функция СлучайноеБулево() Экспорт
	
	Возврат ГСЧ.СлучайноеЧисло() % 2 = 0;
	
КонецФункции

// Возвращает случайную строку указанной длины, состоящую из допустимых символов.
//
// Параметры:
//	Длина - Число - Длина возвращаемой строки. По умолчанию равно 10.
//
// Возвращаемое значение:
//	Строка - Случайная строка указанной длины, состоящая из допустимых символов.
Функция СлучайнаяСтрока(Знач Длина = 10) Экспорт
	
	Результат = "";
	
	ДопустимыеСимволы = "_0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	
	Для Инд = 1 По Длина Цикл
		
		Результат = Результат + Сред(ДопустимыеСимволы, ГСЧ.СлучайноеЧисло(1, 129), 1);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает случайное число в указанном диапазоне.
//
// Параметры:
//	Минимум - Число - Минимальное значение диапазона. По умолчанию равно 0.
//	Максимум - Число - Максимальное значение диапазона. Если значение не указано, то будет использовано максимальное значение для целых чисел.
//	ЗнаковПослеЗапятой - Число - Количество знаков после запятой для случайного числа. По умолчанию равно 0.
//
// Возвращаемое значение:
//	Число - Случайное число в указанном диапазоне.
Функция СлучайноеЧисло(Минимум = 0, Максимум = Неопределено, ЗнаковПослеЗапятой = 0) Экспорт
	
	Если Максимум = Неопределено Тогда
		Результат = ГСЧ.СлучайноеЧисло(Минимум);
	Иначе
		Результат = ГСЧ.СлучайноеЧисло(Минимум, Максимум);
	КонецЕсли;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Множитель = Pow(10, ЗнаковПослеЗапятой);
		Результат = Результат + Окр(ГСЧ.СлучайноеЧисло(0, Множитель) / Множитель, ЗнаковПослеЗапятой);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает случайную дату в указанном диапазоне.
//
// Параметры:
//	Минимум - Дата - Минимальное значение диапазона. По умолчанию равно 01.01.0001.
//	Максимум - Дата - Максимальное значение диапазона. По умолчанию равно 31.12.3999.
//
// Возвращаемое значение:
//	Дата - Случайная дата в указанном диапазоне.
Функция СлучайнаяДата(Знач Минимум = '00010101', Знач Максимум = '39991231') Экспорт
	
	Если Минимум = Максимум Тогда
		Возврат Минимум;
	ИначеЕсли Максимум < Минимум Тогда
		ВызватьИсключение НСтр("ru = 'Некорректные параметры метода ''СлучайнаяДата'': максимальное значение должно быть больше минимального!'");
	КонецЕсли;
	
	РазностьДат = Максимум - Минимум; // Число
	
	Если РазностьДат <= 4294967295 Тогда // Максимум генератора
		Возврат Минимум + ГСЧ.СлучайноеЧисло(0, РазностьДат);
	КонецЕсли;
	
	СекундВДне = 86400;
	КоличествоДней = Цел((РазностьДат) / СекундВДне);
	
	Возврат Минимум + ГСЧ.СлучайноеЧисло(0, КоличествоДней) * СекундВДне + ГСЧ.СлучайноеЧисло(0, СекундВДне);
	
КонецФункции

// Возвращает случайное значение из указанного списка.
//
// Параметры:
//	Список - Массив из Произвольный - Список значений, из которых будет выбрано случайное значение.
//
// Возвращаемое значение:
//	Произвольный - Случайное значение из указанного списка.
Функция СлучайноеЗначениеИзСписка(Список) Экспорт
	
	Если Список.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Список[ГСЧ.СлучайноеЧисло(0, Список.ВГраница())];
	
КонецФункции

// Возвращает случайное значение перечисления.
//
// Параметры:
//	Перечисление - ПеречислениеМенеджер - Менеджер перечисления.
// 
// Возвращаемое значение:
//	ПеречислениеСсылка - Случайное значение перечисления.
Функция СлучайноеЗначениеПеречисления(Перечисление) Экспорт
	
	Возврат Перечисление.Получить(ГСЧ.СлучайноеЧисло(0, Перечисление.Количество()-1));
	
КонецФункции

#КонецОбласти

#Область Инициализация

ГСЧ = Новый ГенераторСлучайныхЧисел;

#КонецОбласти

#КонецЕсли
