// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СгенерироватьТестовыеДанные(Команда)
	
	ОчиститьСообщения();
	
	РазмерСправочника = РазмерТестовогоСправочника(); // Число
	Если РазмерСправочника = 0 Тогда
		ПредупреждениеАсинх(НСтр("ru = 'Не заполнен ''Тестовый справочник''!'"));
		Возврат;
	КонецЕсли;
	
	Количество = Ждать ВвестиЧислоАсинх(10, НСтр("ru = 'Сколько?'"), 32, 0);
	Если Количество = Неопределено Или Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Заполнение текстового регистра'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СгенерироватьДанныеВФоне(Количество, РазмерСправочника),
		Новый ОписаниеОповещения("ЗавершитьЗаполнение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыгрузки(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check undefined-variable
	//@skip-check dynamic-access-method-not-found
	кфкИнтеграцияКлиент.ИсторияВыгрузкиОбъекта(ТекущаяСтрока, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершить заполнение.
// 
// Параметры:
//  Результат - Структура - Результат:
//   * Статус - Строка - Статус
//   * ИнформацияОбОшибке - ИнформацияОбОшибке - Информация об ошибке
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьЗаполнение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазмерТестовогоСправочника()
	
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ Справочник.кфк_т_ТестовыйСправочник");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка[0]; // Число
	
КонецФункции

&НаСервере
Функция СгенерироватьДанныеВФоне(Количество, РазмерСправочника)
	
	Если Количество <= (РазмерПакета() * 1.5) Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
			"РегистрыСведений.кфк_т_ТестовыйРегистр.СгенерироватьТестовыеДанные", Количество, РазмерСправочника);
		
	Иначе
		
		Возврат ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
			"РегистрыСведений.кфк_т_ТестовыйРегистр.СгенерироватьТестовыеДанные",
			ДлительныеОперации.ПараметрыВыполненияПроцедуры(),
			СформироватьНаборПараметров(Количество, РазмерСправочника));
			
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьНаборПараметров(Количество, РазмерСправочника)
	
	Результат = Новый Соответствие;
	
	РазмерПакета = РазмерПакета();
	Остаток = Количество;
	Для Номер = 1 По Цел(Количество / РазмерПакета) + 1 Цикл
		
		ПараметрыПотока = Новый Массив(2); // Массив Из Число
		ПараметрыПотока[0] = Мин(Остаток, РазмерПакета);
		ПараметрыПотока[1] = РазмерСправочника;
		
		Результат.Вставить(СтрШаблон("ГенерацияТестовогоРегистра_%1", XMLСтрока(Номер)), ПараметрыПотока);
		
		Остаток = Остаток - РазмерПакета;
		Если Остаток <= 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазмерПакета()
	Возврат 10000;
КонецФункции

#КонецОбласти
