//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализацияДанных() Экспорт
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Константы.кфкИспользоватьПотоковыйРежим.Установить(Истина);
	
	Брокер = Брокер();
	
	Родитель = ПродюсерДЗ();
	ПродюсерСправочника(Брокер, Родитель);
	ПродюсерРегистра(Брокер, Родитель);
	
	Родитель = КонсьюмерДЗ();
	КонсьюмерСправочника(Брокер, Родитель);
	КонсьюмерРегистра(Брокер, Родитель);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Брокер()

	Объект = Справочники.кфкБрокеры.СоздатьЭлемент();
	Объект.Наименование = НСтр("ru = 'Брокер по умолчанию'");
	
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29091";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29092";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Ложь;
	НоваяСтрока.Адрес = "localhost:29093";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#Область Продюсеры

Функция ПродюсерДЗ()
	
	Объект = Справочники.кфкПродюсеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "Справочник.кфк_т_ТестовыйСправочник";
	НоваяСтрока.ИмяТопика = "1c.test-catalog";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "Справочники.кфк_т_ТестовыйСправочник.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "Справочник_ТестовыйСправочник_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("ИмяМетодаПоиска", "Справочники.кфк_т_ТестовыйСправочник.ПодборДанных"));
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: ТестовыйРегистр'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистр";
	НоваяСтрока.ИмяТопика = "1c.test-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистр.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистр_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("ИмяМетодаПоиска", "РегистрыСведений.кфк_т_ТестовыйРегистр.ПодборДанных"));
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Консьюмеры

Функция КонсьюмерДЗ()
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-catalog";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "Справочники.кфк_т_ТестовыйСправочник.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testCatalog_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: ТестовыйРегистр'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-register";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "РегистрыСведений.кфк_т_ТестовыйРегистр.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testRegister_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти
